{"basics":{"name":"Weiqin Yang","label":"AI/ML Researcher","image":"","email":"futurelover10032@gmail.com","phone":"(+86) 138-7039-5611","url":"https://tiny-snow.github.io/","summary":"A CS Master student in Zhejiang University, China, researching on recommender systems","location":{"address":"38 Zheda Road","postalCode":"310027","city":"Hangzhou","countryCode":"CN","region":"Zhejiang"}},"work":[],"volunteer":[],"education":[{"institution":"Zhejiang University","location":"Zhejiang, China","url":"https://www.zju.edu.cn/","area":"Computer Science and Technology","studyType":"Master","startDate":"2024-09-06","endDate":"Present","score":"N/A"},{"institution":"Shandong University","location":"Shandong, China","url":"https://www.sdu.edu.cn/","area":"Computer Science and Technology","studyType":"Bachelor","startDate":"2020-09-07","endDate":"2024-06-30","score":"93.32/100","courses":["GPA: 93.32/100","Rank: 2/197"]}],"internships":[],"awards":[{"title":"National Scholarship","date":"2023, 2022","awarder":"Ministry of Education of the People's Republic of China","summary":"The National Scholarship is the highest award for Chinese students in China, which is awarded by the Ministry of Education of the People's Republic of China."},{"title":"Honors Bachelor Degree of Shandong University","date":"2024","awarder":"Shandong University","summary":"The Honors Bachelor Degree of Shandong University is awarded to students who have excellent academic performance and outstanding comprehensive quality (GPA Top 5% and all courses above 85, or published first-author SCI papers)."},{"title":"Outstanding Graduate of Shandong University","date":"2024","awarder":"Shandong University","summary":"The Outstanding Graduate of Shandong University is awarded to excellent graduates who have made outstanding achievements in various fields."},{"title":"Outstanding Undergraduate Thesis of Shandong University","date":"2024","awarder":"Shandong University","summary":"The Outstanding Undergraduate Thesis of Shandong University is awarded to students who have written excellent undergraduate theses (Top 3%)."},{"title":"Outstanding Youth League Member of Shandong University","date":"2024","awarder":"Shandong University","summary":"The Outstanding Youth League Member of Shandong University is awarded to the youth league members who have made outstanding contributions to the university."},{"title":"Star of Self-improvement Nomination Award of Shandong University","date":"2023","awarder":"Shandong University","summary":"The Star of Self-improvement Nomination Award of Shandong University is awarded to students who have a strong sense of self-improvement and have made outstanding achievements that distinguish them from others."},{"title":"First-class Academic Scholarship of Shandong University","date":"2023, 2022, 2021","awarder":"Shandong University","summary":"The First-class Academic Scholarship of Shandong University is awarded to students who have excellent academic performance (GPA Top 5%) in the previous academic year."},{"title":"Huawei Scholarship","date":"2023, 2022, 2021","awarder":"Huawei Technologies Co., Ltd.","summary":"The Huawei Scholarship is awarded to students who have excellent performance in the previous academic year, and actively participate in projects and competitions organized by Huawei."},{"title":"Zhiyang Scholarship","date":"2022","awarder":"Zhiyang Innovation Technology Co., Ltd.","summary":"The Zhiyang Scholarship is awarded to students who have excellent academic performance in Computer Elite Class, School of Computer Science and Technology, Shandong University."},{"title":"Merit Student of Shandong University","date":"2021","awarder":"Shandong University","summary":"The Merit Student of Shandong University is awarded to students who have excellent academic performance, outstanding comprehensive quality, and good moral character."},{"title":"First-class Scholarship for Research and Innovation of Shandong University","date":"2021","awarder":"Shandong University","summary":"The First-class Scholarship for Research and Innovation of Shandong University is awarded to students who have made outstanding achievements in scientific research and competitions in the previous academic year."},{"title":"Weichai Power Scholarship","date":"2021","awarder":"Weichai Power Co., Ltd.","summary":"The Weichai Power Scholarship is awarded to students who have excellent performance in the previous academic year, but not awarded the National Scholarship."}],"competitions":[{"title":"The 6th Alibaba Global Mathematics Competition: Finalist #54","date":"2024","awarder":"DAMO Academy, Alibaba Group","summary":"The Alibaba Global Mathematics Competition is a global mathematics competition organized by DAMO Academy, Alibaba Group. The competition is open to all college students around the world. There are 802 finalists in 2024."},{"title":"The 5th Alibaba Global Mathematics Competition: Finalist #198","date":"2023","awarder":"DAMO Academy, Alibaba Group","summary":"The Alibaba Global Mathematics Competition is a global mathematics competition organized by DAMO Academy, Alibaba Group. The competition is open to all college students around the world. There are 685 finalists in 2023."},{"title":"COMAP's 2023 Mathematical Contest in Modeling: Finalist Winner","date":"2023","awarder":"Consortium for Mathematics and its Applications (COMAP)","summary":"The Mathematical Contest in Modeling (MCM), also known as the American Mathematical Contest in Modeling, is a famous international mathematical modeling competition for college students. The Finalists are Top 2% winners."},{"title":"The 4th Alibaba Global Mathematics Competition: Finalist #477","date":"2022","awarder":"DAMO Academy, Alibaba Group","summary":"The Alibaba Global Mathematics Competition is a global mathematics competition organized by DAMO Academy, Alibaba Group. The competition is open to all college students around the world. There are 715 finalists in 2022."},{"title":"The 14th Chinese Mathematics Competitions (Math Major A Group): First Prize","date":"2022","awarder":"Chinese Mathematical Society","summary":"The Chinese Mathematics Competitions (CMC) is a national mathematics competition for college students in China, which is organized by the Chinese Mathematical Society. The Math Major A Group is for students who are majoring in mathematics."},{"title":"The 13th Chinese Mathematics Competitions (Non-math Major Group): First Prize","date":"2021","awarder":"Chinese Mathematical Society","summary":"The Chinese Mathematics Competitions (CMC) is a national mathematics competition for college students in China, which is organized by the Chinese Mathematical Society. The Non-math Major Group is for students who are not majoring in mathematics."},{"title":"The 12th Chinese Mathematics Competitions (Non-math Major Group): First Prize","date":"2020","awarder":"Chinese Mathematical Society","summary":"The Chinese Mathematics Competitions (CMC) is a national mathematics competition for college students in China, which is organized by the Chinese Mathematical Society. The Non-math Major Group is for students who are not majoring in mathematics."}],"reviewer":[],"certificates":[],"publications":[],"skills":[],"languages":[],"interests":[],"references":[],"projects":[]}